def get_hebrew_prompt_template() -> str:
    dynamic_examples = [
        {
            "משפט": "עולה מניתוח של 7,500 מחקרים שפורסמו בנושא בין השנים 1973 עד 2011 כי ב־40 השנים האחרונות יש מגמת ירידה מתמשכת בפוריות הגבר בעולם המערבי ונרשמה ירידה של יותר מ־50 אחוזים בריכוז ובספירת הזרע",
            # "ניתוח": "מדובר על פוריות הגבר בעולם המערבי, וירידה בריכוז ובספירת הזרע.",
            "נושא": "פוריות הגבר",
        },
        {
            "משפט": "עם עומסי החום של הקיץ והגידול בשימוש במזגנים, עולות גם התקלות, ומדריך זה סוקר את התקלות הנפוצות, עלויות התיקון והמלצות לבחירת מזגן",
            # "ניתוח": "מדובר על מזגנים, תקלות נפוצות ועלויות תיקון.",
            "נושא": "תחזוקת מזגנים ",
        },
        {
            "משפט": "משרד הבריאות פרסם את נתוני התחלואה בקורונה: אחוז החיוביים ירד; בישראל יש 8,310 חולים פעילים; סך המחלימים עומד על 325,862; מספר הנפטרים מפרוץ המגפה עומד על 2,735",
            # "ניתוח": "מדובר על נתוני תחלואה בקורונה בישראל",
            "נושא": "קורונה",
        },
        {
            "משפט": "כחלק מהפתרונות היצירתיים הללו חוזרים אלינו לאחרונה משחקי הילדות של דור ההורים שלא ידע אינטרנט, טאבלט, אייפון ואקס בוקס, והסתפק במשחקי רחוב עם שאר הילדים",
            # "ניתוח": "מדובר על משחקי הילדות של דור ההורים, משחקים ללא טכנולוגיה מודרנית.",
            "נושא": "משחקים",
        },
        {
            "משפט": "ישראל הצהירה כי לא תאפשר שיקום עזה ללא פתרון לסוגיית השבויים והנעדרים, אך נותר לראות אם תצליח לעמוד בהבטחתה",
            # "ניתוח": "מדובר על הצהרת ישראל בנוגע לשיקום עזה ולסוגיית השבויים והנעדרים.",
            "נושא": "שיקום רצועת עזה",
        },
        {
            "משפט": "מאז שהמחיר ביניהם הושווה, רכבי הפנאי מזנבים במכירות המשפחתיים, כשיבואני המשפחתיים נאלצים להוריד מחירים או להעלות ברמת האבזור",
            # "ניתוח": "מדובר על רכבי פנאי לעומת רכבים משפחתיים, והשפעת המחיר על המכירות.",
            "נושא": "רכבי פנאי",
        },
        {
            "משפט": "הפטרייה, קורדיספס שמה, משתלטת על מוחן של נמלים וכופה עליהן לטפס לגובה רב כדי לפזר את נבגיה",
            # "ניתוח": "מדובר על פטרייה בשם קורדיספס שמשפיעה על נמלים.",
            "נושא": "קורדיספס",
        },
    ]

    base_prompt = """הוראות:
        בהינתן טקסט, ומשפט ממנו,
        עליך לקרוא את המשפט, לנתח אותו בקצרה, ולאחר מכן להחזיר את הנושא המרכזי שבו המשפט עוסק - השתמש בטקסט כקונטקסט.

        הגדרות:
        הנושא הוא התחום המרכזי של המשפט (למשל: פוליטיקה, רפואה, חינוך, ספורט, כלכלה, ביטחון, טכנולוגיה ועוד).
        אל תיתן יותר מנושא אחד.
        הנושא צריך להיות מילה אחת או ביטוי קצר (עד 3 מילים).
        אין צורך בניסוחים כמו "הנושא הוא" - כתוב רק את הנושא.
        אם לא ניתן לזהות נושא - כתוב: לא ברור.
        כאשר קיימת ישות פועלת (למשל: "ישראל הודיעה כי..."), זהה את התחום שבו עוסקת ההצהרה, ולא את שם הגוף הפועל.
        יש מקרים בהם תצטרך להיות כללי יותר או ספציפי יותר, בהתאם למשמעות המשפט.
        אם המשפט עוסק בכמה נושאים, בחר את הנושא המרכזי ביותר.
        אם הנושא שמצאת הוא ברבים - הפוך אותו ליחיד.

        שלבי עבודה:
        1. נתח את משמעות המשפט.
        2. זהה על איזה תחום עוסק המשפט.
        3. החזר את הנושא.
        """

    examples_prompt = "\n".join(
        [f"משפט: {ex['משפט']}\nנושא: {ex['נושא']}" for ex in dynamic_examples]
    )

    final_prompt = (
        base_prompt
        + "\n\nקונטקסט:"
        + "{context}"
        + "\n\nדוגמאות:\n"
        + examples_prompt
        + "\n\nמשפט: {sentence}\nנושא:"
    ).strip()

    return final_prompt


def get_english_prompt_template() -> str:
    return ""


def get_prompt(language: str) -> str:
    if language == "he":
        return get_hebrew_prompt_template()
    elif language == "en":
        return get_english_prompt_template()
    else:
        raise ValueError(f"Invalid langauge: {language}")
